Revit 2024 API
BuiltInFailures.EditingFailures.TemporaryChangesTransparentPermissions Property
 Permission to edit the element cannot be obtained. Changes will be temporary, and will not be saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TemporaryChangesTransparentPermissions { get; }
Visual Basic
Public Shared ReadOnly Property TemporaryChangesTransparentPermissions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TemporaryChangesTransparentPermissions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace